# ============================================================
#   Brewfile - Homebrew packages
# ============================================================

# CLI Tools
brew "git"
brew "neovim"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "tree-sitter"
brew "colordiff"
brew "jq"
brew "yq"              # YAML processor (jq for YAML)
brew "eza"             # Modern ls replacement
brew "bat"             # Cat with syntax highlighting
brew "direnv"          # Directory-specific env vars
brew "starship"

# Runtime Version Manager
brew "mise"

# Development
brew "gh"              # GitHub CLI
brew "lazygit"         # Git TUI

# File Manager & Navigation
brew "yazi"            # Terminal file manager
brew "zoxide"          # Smarter cd command

# Zsh Plugin Manager
brew "sheldon"

# Browsers
cask "google-chrome"
cask "microsoft-edge"

# Utilities
brew "defaultbrowser"   # Set default browser from CLI

# Applications (optional - uncomment as needed)
# cask "cursor"
# cask "slack"
# cask "docker"

# Terminal
cask "iterm2"

# Fonts
cask "font-hack-nerd-font"
