# ============================================================
#   Brewfile - Homebrew packages
# ============================================================

# CLI Tools
brew "git"
brew "neovim"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "tree-sitter"
brew "colordiff"
brew "jq"
brew "yq"              # YAML processor (jq for YAML)
brew "eza"             # Modern ls replacement
brew "bat"             # Cat with syntax highlighting
brew "wget"
brew "tmux"
brew "btop"            # Process monitor
brew "direnv"          # Directory-specific env vars
brew "starship"
# Input method switcher (tap: laishulu/homebrew)
tap "laishulu/homebrew"
brew "macism"          # Input method switcher for Neovim

# AI agent
cask "claude-code"

# Runtime Version Manager
brew "mise"

# Development
brew "gh"              # GitHub CLI
brew "lazygit"         # Git TUI
brew "mdserve"         # Markdown preview server
brew "awscli"          # AWS CLI
# Infrastructure as Code
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"

# File Manager & Navigation
brew "yazi"            # Terminal file manager
brew "zoxide"          # Smarter cd command

# Zsh Plugin Manager
brew "sheldon"

# Dashboard
brew "wtfutil"

# Browsers
cask "google-chrome"
cask "microsoft-edge"

# Utilities
brew "defaultbrowser"   # デフォルトブラウザをCLIで設定
cask "raycast"          # Spotlight代替ランチャー

# Applications
cask "docker-desktop"
cask "zed"
# cask "cursor"
# cask "slack"

# Terminal
cask "iterm2"

# Fonts
cask "font-hack-nerd-font"
