# ============================================================
#   Brewfile - Homebrew packages
# ============================================================

# CLI Tools
brew "git"
brew "neovim"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "tree-sitter"
brew "colordiff"
brew "jq"
brew "starship"

# Runtime Version Manager
brew "mise"

# Development
brew "gh"              # GitHub CLI
brew "lazygit"         # Git TUI

# File Manager & Navigation
brew "yazi"            # Terminal file manager
brew "zoxide"          # Smarter cd command

# Applications (optional - uncomment as needed)
# cask "cursor"
# cask "google-chrome"
# cask "slack"
# cask "docker"

# Terminal
cask "iterm2"
